## Data Creation

# data function to put into class

In [1]:
import pandas as pd
import numpy as np
import sqlite3
from db_builder import SchoolDataGenerator
from class_test import QueryTest

# Instantiate the class
school_data = SchoolDataGenerator()
test_instance = QueryTest()

# Generate data & create the database
school_data.generate_data()
school_data.populate_db()

# Global variable 
sql = school_data.sql
conn = school_data.conn

# Table Schemas

<table>
  <tr>
    <td>
      <h3>students Table Schema</h3>
      <table border="1">
        <tr><th>Column Name</th><th>Data Type</th></tr>
        <tr><td>student_id</td><td>INTEGER</td></tr>
        <tr><td>first_name</td><td>TEXT</td></tr>
        <tr><td>last_name</td><td>TEXT</td></tr>
        <tr><td>grade_level</td><td>TEXT</td></tr>
        <tr><td>email</td><td>TEXT</td></tr>
      </table>
    </td>
    <td>
      <h3>assignments Table Schema</h3>
      <table border="1">
        <tr><th>Column Name</th><th>Data Type</th></tr>
        <tr><td>assignment_id</td><td>INTEGER</td></tr>
        <tr><td>assignment_name</td><td>TEXT</td></tr>
        <tr><td>due_date</td><td>TEXT</td></tr>
      </table>
    </td>
  </tr>
  <tr>
    <td>
      <h3>grades Table Schema</h3>
      <table border="1">
        <tr><th>Column Name</th><th>Data Type</th></tr>
        <tr><td>grade_id</td><td>INTEGER</td></tr>
        <tr><td>student_id</td><td>INTEGER</td></tr>
        <tr><td>assignment_id</td><td>INTEGER</td></tr>
        <tr><td>grade</td><td>TEXT</td></tr>
        <tr><td>numeric_score</td><td>INTEGER</td></tr>
      </table>
    </td>
    <td>
      <h3>participation_behavior Table Schema</h3>
      <table border="1">
        <tr><th>Column Name</th><th>Data Type</th></tr>
        <tr><td>record_id</td><td>INTEGER</td></tr>
        <tr><td>student_id</td><td>INTEGER</td></tr>
        <tr><td>attendance</td><td>TEXT</td></tr>
        <tr><td>participation_grade</td><td>INTEGER</td></tr>
        <tr><td>behavior_grade</td><td>INTEGER</td></tr>
      </table>
    </td>
  </tr>
</table>

# Exercise 1: Basic Queries

## Basic Query Objectives

In this exercise, you will:

1. **Use the `SELECT` Statement:**
   - Retrieve specific columns from a table.

2. **Filter Results with the `WHERE` Clause:**
   - Apply conditions to filter the data returned by the query.

3. **Sort Data with the `ORDER BY` Clause:**
   - Arrange the results in a specified order.

4. **Combine All Three Techniques:**
   - Create a query that integrates `SELECT`, `WHERE`, and `ORDER BY` to retrieve and organize data according to specified criteria.

For this excercise we will use the Students table

### `students` Table Schema

| Column Name | Data Type |
|-------------|-----------|
| student_id | INTEGER |
| first_name | TEXT |
| last_name | TEXT |
| grade_level | TEXT |
| email | TEXT |

Preform a Select Query:

- `SELECT *`: This part of the query specifies that you want to retrieve all columns from the table.
- `FROM students`: This specifies the table from which to retrieve the data, which is `students` in this case.
- The semicolon (`;`) at the end of the query denotes the end of the SQL command.

In [2]:
select_query = """
SELECT * FROM students
"""

sql(select_query).head()

   student_id first_name last_name grade_level                email
0           1       Ryan   Sanchez        12th  student1@school.com
1           2      Emily   Ramirez        10th  student2@school.com
2           3       John     Smith        12th  student3@school.com
3           4        Ava    Harris        12th  student4@school.com
4           5      David  Robinson        10th  student5@school.com

In [3]:
test_instance.select_test(select_query)

Select query was successful with the correct shape and columns

## Perform a Select Query with Filtering:

- `SELECT *`: This part of the query retrieves all columns from the table.
- `FROM students`: Specifies the table from which to retrieve the data, which is `students`.
- `WHERE grade_level = '12th'`: Filters the results to include only rows where the `grade_level` column is equal to `'12th'`.
- The semicolon (`;`) at the end of the query denotes the end of the SQL command.

In [4]:
where_query = """
SELECT * FROM students WHERE grade_level = '12th'
"""

sql(where_query)

    student_id first_name  last_name grade_level                 email
0            1       Ryan    Sanchez        12th   student1@school.com
1            3       John      Smith        12th   student3@school.com
2            4        Ava     Harris        12th   student4@school.com
3            7    Brandon   Thompson        12th   student7@school.com
4            9       Zach  Hernandez        12th   student9@school.com
5           10       Emma  Rodriguez        12th  student10@school.com
6           11       Alex      Jones        12th  student11@school.com
7           12     Joshua     Miller        12th  student12@school.com
8           14       Jane      Brown        12th  student14@school.com
9           28      James     Thomas        12th  student28@school.com
10          29     Daniel      White        12th  student29@school.com
11          30   Isabella   Anderson        12th  student30@school.com

In [5]:
test_instance.where_test(where_query)

WHERE query was successful: All rows have grade_level '12th'

## Perform a Select Query with Sorting:

- `SELECT *`: This part of the query retrieves all columns from the table.
- `FROM students`: Specifies the table from which to retrieve the data, which is `students`.
- `ORDER BY last_name ASC`: Sorts the results by the `last_name` column in ascending order (`ASC`).
- The semicolon (`;`) at the end of the query denotes the end of the SQL command.

In [6]:
orderby_query = """
SELECT * FROM students ORDER BY last_name ASC;
"""

sql(orderby_query).head()

   student_id first_name last_name grade_level                 email
0          30   Isabella  Anderson        12th  student30@school.com
1          14       Jane     Brown        12th  student14@school.com
2          18       Lily     Clark        11th  student18@school.com
3          23     Robert     Davis        11th  student23@school.com
4           6      Sarah    Garcia        10th   student6@school.com

In [7]:
test_instance.orderby_test(orderby_query, order='ASC')

ORDER BY query was successful: First few rows are sorted by last_name in ASC order

## Perform a Select Query with Filtering and Sorting:

- `SELECT *`: Retrieves all columns from the table.
- `FROM students`: Specifies the table from which to retrieve the data, which is `students`.
- `WHERE grade_level = '12th'`: Filters the results to include only rows where the `grade_level` column is `'12th'`.
- `ORDER BY last_name ASC`: Sorts the filtered results by the `last_name` column in ascending order (`ASC`).
- The semicolon (`;`) at the end of the query denotes the end of the SQL command.

In [8]:
multi_query = """
SELECT * 
FROM students 
WHERE grade_level = '12th' 
ORDER BY last_name ASC;
"""

sql(multi_query).head()

   student_id first_name  last_name grade_level                 email
0          30   Isabella   Anderson        12th  student30@school.com
1          14       Jane      Brown        12th  student14@school.com
2           4        Ava     Harris        12th   student4@school.com
3           9       Zach  Hernandez        12th   student9@school.com
4          11       Alex      Jones        12th  student11@school.com

In [9]:
test_instance.multi_query_test(multi_query)

Multi-query was successful: All rows have grade_level '12th' and are sorted by last_name

## What We Learned

1. **Basic Query Retrieval:**
   - **Query:** `SELECT * FROM students;`
   - **Learning:** This query retrieves all columns and rows from the `students` table. It shows how to use the `SELECT` statement to access the entire dataset from a specified table.

2. **Filtering Results:**
   - **Query:** `SELECT * FROM students WHERE grade_level = '12th';`
   - **Learning:** This query filters the results to include only those rows where the `grade_level` is `'12th'`. It demonstrates how to use the `WHERE` clause to specify conditions and limit the data retrieved based on criteria.

3. **Sorting Results:**
   - **Query:** `SELECT * FROM students ORDER BY last_name ASC;`
   - **Learning:** This query retrieves all rows from the `students` table and sorts them by the `last_name` column in ascending order. It shows how to use the `ORDER BY` clause to arrange the data in a specified order.

4. **Combining Filtering and Sorting:**
   - **Query:** `SELECT * FROM students WHERE grade_level = '12th' ORDER BY last_name ASC;`
   - **Learning:** This query combines both filtering and sorting. It retrieves rows where `grade_level` is `'12th'` and then sorts these filtered results by `last_name` in ascending order. This demonstrates how to integrate multiple clauses to refine and organize the data retrieval.

By performing these queries, we learned how to retrieve data from a table, apply filters to focus on specific records, sort the results, and combine these techniques to produce more targeted and organized data output.

# Exercise 2

The goal of this exercise is to perform 2 of the 4 different types of SQL joins.

The 4 types of joins are:
- Inner Join
- Left Join
- Right Join
- Full Outer Join

Left Join:

Using the two tables, `students` and `grades`. Your task is to write an SQL query to retrieve a list of all students along with their corresponding grades for any assignments they have completed.

Left Join Instructions:

1. Use the `students` table as the primary table.
1. Perform a `LEFT JOIN` with the `grades` table on the common `student_id` column.
1. Select the following columns in your query:
  - `student_id` from the `students` table
  - `first_name` from the `students` table
  - `last_name` from the `students` table
  - `assignment_id` from the `grades` table
  - `grade` from the `grades` table

In [10]:
left_join_query = """
SELECT 
    s.student_id, s.first_name, s.last_name, g.assignment_id, g.grade 
FROM students as s 
LEFT JOIN grades as g ON s.student_id = g.student_id;
"""

left_join = sql(left_join_query)
left_join

     student_id first_name last_name  assignment_id grade
0             1       Ryan   Sanchez              1     F
1             1       Ryan   Sanchez              2     A
2             1       Ryan   Sanchez              3     B
3             1       Ryan   Sanchez              4     A
4             1       Ryan   Sanchez              5     A
..          ...        ...       ...            ...   ...
295          30   Isabella  Anderson              6     A
296          30   Isabella  Anderson              7     D
297          30   Isabella  Anderson              8     D
298          30   Isabella  Anderson              9     A
299          30   Isabella  Anderson             10     D

[300 rows x 5 columns]

In [11]:
test_instance.left_join_test(left_join_query)

LEFT JOIN query shape is correct: (300, 5)
LEFT JOIN query contains all expected columns.

Inner join Instructions:
1. Use the students table as the primary table.
1. Perform an INNER JOIN with the grades table on the common student_id column.
1. Select the following columns in your query:

  - ~~student_id from the students table~~
  - first_name from the students table
  - last_name from the students table
  - ~~assignment_id from the grades table~~
  - grade from the grades table

4. Ensure that only the records where there is a matching student_id in both the students and grades tables are included in your result.

In [12]:
inner_join_query = """
SELECT 
    s.first_name, s.last_name, g.grade 
FROM students as s 
INNER JOIN grades as g ON s.student_id = g.student_id;
"""

inner_join = sql(inner_join_query)
inner_join

    first_name last_name grade
0         Ryan   Sanchez     A
1         Ryan   Sanchez     A
2         Ryan   Sanchez     A
3         Ryan   Sanchez     A
4         Ryan   Sanchez     B
..         ...       ...   ...
295   Isabella  Anderson     D
296   Isabella  Anderson     D
297   Isabella  Anderson     D
298   Isabella  Anderson     F
299   Isabella  Anderson     F

[300 rows x 3 columns]

In [13]:
test_instance.inner_join_test(inner_join_query)

INNER JOIN query shape is correct: (300, 3)
INNER JOIN query contains all expected columns.

# Exercise 3

### Goals for this exercise
The goal of this exercuse is to:
- Insert a new record into the `students` table with specific values.
- Delete the new record in the `students` table.
- UPDATE

### Inserting a Record
Insert a new record into the `students` table with specific values.

### Step-by-Step Guide

1. **Identify the Table:**
   - Determine which table you need to `insert` data into. In this case, it is the `students` table.

2. **Specify the Columns:**
   - List the columns that will receive the new data. For this task, the columns are `student_id` = 31, `first_name` = John, `last_name` = Doe, `grade_level` = 12, and `email` = student31@school.com.

3. **Prepare the VALUES Clause:**
   - Decide the values you want to insert for each column. Ensure that the values match the data types expected by the columns.

4. **Write the SQL Query:**
   - Use the `INSERT INTO` statement to specify the table and columns.
   - Follow with the `VALUES` keyword to provide the values.

In [14]:
insert_query = """
INSERT INTO students (student_id, first_name, last_name, grade_level, email) 
VALUES (31, 'John', 'Doe', '12', 'student31@school.com');
"""


conn.execute(insert_query)
conn.commit()
    

student_31_check = sql("SELECT * FROM students WHERE student_id = 31")
student_31_check

   student_id first_name last_name grade_level                 email
0          31       John       Doe          12  student31@school.com

In [15]:
test_instance.insert_test(insert_query)

INSERT query was successful

### Deleting a Record
Remove a specific record from the `students` table based on the `student_id`.

### Step-by-Step Guide

1. **Identify the Table:**
   - Determine from which table you need to delete data. In this case, it is the `students` table.

2. **Specify the Condition:**
   - Identify the specific record to delete by setting a condition. For this task, the condition is `student_id = 31`.

3. **Write the SQL Query:**
   - Use the `DELETE FROM` statement to specify the table.
   - Follow with a `WHERE` clause to define the condition for which row to delete. In this case, it is `WHERE student_id = 31`.

4. **Confirm the Deletion:**
   - Always check that your condition is correct to avoid accidentally deleting the wrong data or more records than intended.

In [16]:
delete_query = """
DELETE FROM students WHERE student_id = 31;
"""

conn.execute(delete_query)
conn.commit()

student_31_check = sql("SELECT * FROM students WHERE student_id = 31")
student_31_check

Empty DataFrame
Columns: [student_id, first_name, last_name, grade_level, email]
Index: []

In [17]:
test_instance.delete_test(delete_query)

DELETE query was successful

In [18]:
insert_query = """
INSERT INTO students (student_id, first_name, last_name, grade_level, email) 
VALUES (31, 'John', 'Doe', '12', 'student31@school.com');
  """

conn.execute(insert_query)
conn.commit()


student_31_check = sql("SELECT * FROM students WHERE student_id = 31")
student_31_check

   student_id first_name last_name grade_level                 email
0          31       John       Doe          12  student31@school.com

In [19]:
test_instance.insert_test(insert_query)

INSERT query was successful

We have added back student_id 31 John Doe witht he above code.

### Updating a Record

In this scenario, we mistakenly entered John Doe's name incorrectly. Instead of adding a new record, we can modify the existing one and update the first name to `Jane`.

### Step-by-Step Guide

1. **Identify the Table:**
   - Determine which table contains the record you want to update. In this case, it's the `students` table.

2. **Use the `UPDATE` Clause:**
   - The `UPDATE` clause allows you to modify existing records in a table.

3. **Set the New Value:**
   - Use the `SET` keyword to specify the column you want to update and the new value. Here, you'll set `first_name` to `Jane`.

4. **Apply a Condition:**
   - Use the `WHERE` clause to identify the specific record you want to update. For this task, update the record where `student_id = 31`.

In [20]:
update_query = """ UPDATE students SET first_name = 'Jane' WHERE student_id = 31;
"""

conn.execute(update_query)
conn.commit()

student_31_check = sql("SELECT * FROM students WHERE student_id = 31")
student_31_check

   student_id first_name last_name grade_level                 email
0          31       Jane       Doe          12  student31@school.com

In [21]:
test_instance.update_query_test(update_query)

UPDATE query was successful

In [22]:
delete_query = """
DELETE FROM students WHERE student_id = 31;
    """

conn.execute(delete_query)
conn.commit()

student_31_check = sql("SELECT * FROM students WHERE student_id = 31")
student_31_check

Empty DataFrame
Columns: [student_id, first_name, last_name, grade_level, email]
Index: []

In [23]:
test_instance.delete_query()

Student 31 has been removed

# exercise 4

Advanced Queries and Filtering
Objective: Deepen understanding of SQL querying with complex filters and aggregations.

Topics:

Complex Filtering:
- Logical operators (AND, OR, NOT).
- BETWEEN, IN, and LIKE operators.
Aggregations:
- GROUP BY clause.
- Aggregate functions (COUNT, SUM, AVG, MAX, MIN)

### Writing a Query with a using a logical operator

Write a SQL query to retrieve a list of 12th-grade students along with their grades, including those who might not have a grade recorded yet.

### Instructions:
1. **Use a `LEFT JOIN`** to combine the `students` table with the `grades` table. This will ensure that all students are included in the result, even if they don't have a grade recorded.
2. **Filter for 12th-grade students** by setting a condition on the `grade_level` column.
3. **Include only students who have an 'A' or 'B' grade**, or students with no grade at all.
4. **Select the following columns** to be returned in the result:
   - `student_id`, `first_name`, `last_name`, `grade_level` from the `students` table.
   - `grade` from the `grades` table.

In [24]:
Logical_operators = """
SELECT 
    s.student_id, s.first_name, s.last_name, s.grade_level, g.grade 
FROM students as s 
LEFT JOIN grades as g ON s.student_id = g.student_id 
WHERE 
    grade_level = '12th' AND (grade = 'A' OR grade = 'B');
"""

sql(Logical_operators).head()

   student_id first_name last_name grade_level grade
0           1       Ryan   Sanchez        12th     A
1           1       Ryan   Sanchez        12th     A
2           1       Ryan   Sanchez        12th     A
3           1       Ryan   Sanchez        12th     A
4           1       Ryan   Sanchez        12th     B

In [25]:
test_instance.logical_operators_test(Logical_operators)

Logical_operators query was successful with correct columns, grade_level, and grade

### Writing a Query with BETWEEN, IN, and LIKE

Write a SQL query to retrieve student information from the `students` table along with their grades from the `grades` table. Use the following guidelines:

1. **Select Columns**: Retrieve the `student_id`, `first_name`, `last_name`, and `grade_level` from the `students` table. Also retrieve the `grade` from the `grades` table.
2. **Join**: Use an `INNER JOIN` to connect the `students` table with the `grades` table on the `student_id` column.
3. **Filter Conditions**:
   - Only include students whose `student_id` is between 1 and 7.
   - Filter the students so that their `first_name` starts with the letter 'A' or 'J'.
   - Only include students whose grades are either 'A', 'B', or 'C'.

Write the query to meet all of the above conditions.

In [26]:
filter_query = """
SELECT 
    s.student_id, s.first_name, s.last_name, s.grade_level, g.grade 
FROM 
    students as s 
INNER JOIN grades as g ON s.student_id = g.student_id 
WHERE 
    (s.student_id BETWEEN 1 AND 7) AND (s.first_name LIKE 'A%' OR first_name LIKE 'J%') AND (g.grade IN ('A', 'B', 'C'));
"""

filter_result = sql(filter_query)
filter_result

    student_id first_name last_name grade_level grade
0            3       John     Smith        12th     B
1            3       John     Smith        12th     B
2            3       John     Smith        12th     C
3            3       John     Smith        12th     C
4            3       John     Smith        12th     C
5            4        Ava    Harris        12th     A
6            4        Ava    Harris        12th     A
7            4        Ava    Harris        12th     A
8            4        Ava    Harris        12th     A
9            4        Ava    Harris        12th     B
10           4        Ava    Harris        12th     C

In [27]:
test_instance.filter_query_test(filter_query)

filter_query was successful with correct columns, student_id, first_name, and grade

### Write a Group By Query Averaging Grades

Write a SQL query to calculate the average numeric grade for each `grade_level`. Follow these steps:

1. **Select Columns**:
   - Retrieve `grade_level` from the `students` table.
   - Calculate the average of the numeric score from the `grades` table and label it as `average_grade`.

2. **Join Tables**:
   - Use an `INNER JOIN` to combine the `students` table with the `grades` table based on the `student_id` column.

3. **Group By**:
   - Group the results by `grade_level` from the `students` table.

In [28]:
groupby_query = """
SELECT 
    s.grade_level, 
    AVG(g.numeric_score) AS average_grade 
FROM 
    students as s 
INNER JOIN grades as g ON s.student_id = g.student_id
GROUP BY s.grade_level;
"""

groupby_result = sql(groupby_query)
groupby_result

  grade_level  average_grade
0        10th      72.660000
1        11th      70.925000
2        12th      69.066667

In [29]:
test_instance.groupby_query_test(groupby_query)

Test passed successfully: Provided query matches the expected results

### Task: Calculate the Average Numeric Score by Grade Level Using a CASE Statement

Write a SQL query to calculate the average numeric score for each `grade_level` using the `CASE` statement. Follow these steps:

1. **Select Columns**:
   - Retrieve `grade_level` from the `students` table.
   - Calculate the average numeric score for grades from the `grades` table and label it as `average_grade`. Use the following numeric mapping for grades:
     - 'A' = 4
     - 'B' = 3
     - 'C' = 2
     - 'D' = 1
     - Any other grade should be treated as 0.

2. **Join Tables**:
   - Use an `INNER JOIN` to combine the `students` table with the `grades` table based on the `student_id` column.

3. **Group By**:
   - Group the results by `grade_level` from the `students` table.

In [30]:
gpa_query = """
SELECT 
    s.grade_level,
AVG(CASE
    WHEN g.grade = 'A' THEN 4
    WHEN g.grade = 'B' THEN 3
    WHEN g.grade = 'C' THEN 2
    WHEN g.grade = 'D' THEN 1
    ELSE 0
END) AS average_grade
FROM 
    students AS s 
INNER JOIN grades AS g ON s.student_id = g.student_id
GROUP BY s.grade_level;

"""

gpa_result = sql(gpa_query)
gpa_result

  grade_level  average_grade
0        10th       2.170000
1        11th       2.175000
2        12th       1.916667

In [31]:
test_instance.test_gpa_query(gpa_result)

Test passed successfully

### Case Expressions:

A `CASE` expression is used to evaluate conditions and return values based on those conditions. It works similarly to `if-else` statements in other programming languages.

For this exercise, we will create a `CASE` expression using the `students` and `grades` tables. A `CASE` expression begins with `CASE`, followed by the conditions, and ends with an `ELSE` clause for any unmatched cases.

In this example, we will add a new column called `grade_check` that categorizes students based on their `numeric_score`. The `CASE` expression will classify the grades as follows:

- 'A' for scores of 90 and above
- 'B' for scores between 80 and 89
- 'C' for scores between 70 and 79
- 'F' for scores below 70

Your query should include the following columns: `first_name`, `last_name`, `grade`, `numeric_score`, and the newly created `grade_category`.

In [32]:
case_expression = """
SELECT 
    s.first_name, s.last_name, g.grade, g.numeric_score,
CASE
    WHEN g.numeric_score >= 90 THEN 'A'
    WHEN g.numeric_score BETWEEN 80 AND 89 THEN 'B'
    WHEN g.numeric_score BETWEEN 70 AND 79 THEN 'C'
    WHEN g.numeric_score BETWEEN 60 AND 69 THEN 'D'
    ELSE 'F'
END AS grade_check
FROM 
    students as s
INNER JOIN grades as g ON s.student_id = g.student_id
"""

case_result = sql(case_expression)
case_result.head(30)

   first_name last_name grade  numeric_score grade_check
0        Ryan   Sanchez     A             90           A
1        Ryan   Sanchez     A             93           A
2        Ryan   Sanchez     A             96           A
3        Ryan   Sanchez     A             99           A
4        Ryan   Sanchez     B             84           B
5        Ryan   Sanchez     B             84           B
6        Ryan   Sanchez     C             72           C
7        Ryan   Sanchez     C             75           C
8        Ryan   Sanchez     C             77           C
9        Ryan   Sanchez     F             12           F
10      Emily   Ramirez     A             93           A
11      Emily   Ramirez     A             93           A
12      Emily   Ramirez     A             95           A
13      Emily   Ramirez     B             82           B
14      Emily   Ramirez     B             85           B
15      Emily   Ramirez     B             88           B
16      Emily   Ramirez     C             78           C
17      Emily   Ramirez     D             64           D
18      Emily   Ramirez     D             66           D
19      Emily   Ramirez     F             56           F
20       John     Smith     B             88           B
21       John     Smith     B             88           B
22       John     Smith     C             72           C
23       John     Smith     C             73           C
24       John     Smith     C             73           C
25       John     Smith     D             62           D
26       John     Smith     D             66           D
27       John     Smith     F             16           F
28       John     Smith     F             25           F
29       John     Smith     F             27           F

In [33]:
test_instance.case_expression_test(case_expression)

case_expression query was successful with correct columns and grade_check logic

# exercise 5

Subqueries and Advanced Data Management
Objective: Explore subqueries and advanced data management techniques.

Topics:

Subqueries:
- Using subqueries in SELECT, WHERE, and FROM clauses.
- Correlated subqueries.

Views and Indexes:
- Creating and using VIEWs.
- Understanding and creating indexes.

Transactions:
- Introduction to transactions and the BEGIN, COMMIT, and ROLLBACK statements.

# Subquery Example

A subquery (also called an inner query) is a query nested inside another query. The inner query is executed first, and its result is used by the outer query.

Example: Finding the Highest Grade
``` sql
SELECT student_id, numeric_score
FROM grades
WHERE numeric_score = (SELECT MAX(numeric_score) FROM grades);
Explanation: The subquery (SELECT MAX(numeric_score) FROM grades) finds the highest grade in the grades table. The outer query then retrieves the student_id and numeric_score of the student(s) who received that grade.
```

Note: The subquery does not depend on the outer query. It runs independently and returns a single value (the maximum grade) that is used in the outer query.

# Simple Correlated Subquery Example

A correlated subquery depends on the outer query. The inner query is executed once for every row in the outer query, and it references columns from the outer query.

Example: Finding Students with Above-Average Scores
``` sql
SELECT s.student_id, s.first_name, s.last_name
FROM students s
WHERE s.numeric_score > (
    SELECT AVG(g.numeric_score)
    FROM grades g
    WHERE g.student_id = s.student_id);
```

Explanation: The outer query retrieves each student's student_id, first_name, and last_name. The correlated subquery (SELECT AVG(g.numeric_score) FROM grades g WHERE g.student_id = s.student_id) calculates the average score for the specific student from the outer query (s.student_id).

For each row in the students table, the subquery finds the student's average numeric_score from the grades table, and the outer query checks whether the student’s score is greater than that average.

Note: The subquery depends on the outer query because it references s.student_id. It executes once for each student in the outer query.

# Creating a VIEW

## GPA `VIEW`

### Goal

You are tasked with writing a query to calculate the GPA (Grade Point Average) for each student in a school database. The GPA should be based on the average of their `numeric_score` from the `grades` table.

The query should display the following information:
- Student ID
- First Name
- Last Name
- GPA (average `numeric_score`)

### Tables Involved

1. `students(student_id, first_name, last_name, grade_level, email)`
2. `grades(grade_id, student_id, assignment_id, grade, numeric_score)`

Write an SQL query that:
- Joins the `students` and `grades` tables using the `student_id`.
- Calculates the average `numeric_score` for each student.
- Groups the result by `student_id`, so that each student has one row with their GPA.


## Key Functions Used in the Query

1. **`CREATE VIEW`**: This function creates a virtual table based on a query. The view allows you to save and reuse a query without writing it again. In this case, it creates a view called `StudentGPA`.

2. **`SELECT`**: The `SELECT` statement retrieves specific columns of data, including `student_id`, `first_name`, `last_name`, and the calculated GPA (`gpa`).

3. **`AVG()`**: The `AVG()` function calculates the average of the `numeric_score` column for each student. This function is used here to calculate the student's GPA based on their grades.

4. **`JOIN`**: The `JOIN` function combines rows from the `students` table and the `grades` table based on the `student_id` column. This is an **INNER JOIN**, meaning it only returns students who have matching records in the `grades` table.

5. **`GROUP BY`**: This groups the results by `student_id` so that the `AVG()` function calculates the GPA for each student individually.

---

In [34]:
gpa_view = """
CREATE VIEW StudentGPA AS
SELECT 
    s.student_id, s.first_name, s.last_name, AVG(g.numeric_score) as gpa
FROM 
    students s
INNER JOIN grades g ON s.student_id = g.student_id
GROUP BY s.student_id;

"""

conn.execute(gpa_view)
conn.commit()

sql("SELECT * FROM StudentGPA")

    student_id first_name  last_name   gpa
0            1       Ryan    Sanchez  78.2
1            2      Emily    Ramirez  80.0
2            3       John      Smith  59.0
3            4        Ava     Harris  81.4
4            5      David   Robinson  69.5
5            6      Sarah     Garcia  83.2
6            7    Brandon   Thompson  66.3
7            8      Chris     Wilson  70.8
8            9       Zach  Hernandez  67.6
9           10       Emma  Rodriguez  71.8
10          11       Alex      Jones  70.5
11          12     Joshua     Miller  63.7
12          13     Olivia      Perez  84.0
13          14       Jane      Brown  56.2
14          15      Chloe   Williams  63.7
15          16    Matthew    Jackson  69.1
16          17        Mia    Johnson  72.6
17          18       Lily      Clark  64.0
18          19      Grace   Gonzalez  79.0
19          20      Laura   Martinez  78.2
20          21     Sophia     Martin  66.9
21          22       Anna      Lewis  70.6
22          23     Robert      Davis  67.9
23          24      Katie      Moore  71.2
24          25    Michael        Lee  78.3
25          26     Andrew     Taylor  52.5
26          27      Tyler      Lopez  72.5
27          28      James     Thomas  72.2
28          29     Daniel      White  75.7
29          30   Isabella   Anderson  66.2

In [35]:
test_instance.gpa_view_test(conn, gpa_view)

gpa_view was created successfully with correct columns and valid GPA values

## Report card VIEW

### Goal

You are tasked with creating a query to generate a "report card" view for students in a school database. The view should display the following information:

- Student ID, first name, and last name.
- The numeric scores for the first three assignments as separate columns (`Assignment 1`, `Assignment 2`, `Assignment 3`).
- The average participation grade and average behavior grade for each student.

### Tables Involved

1. `students(student_id, first_name, last_name, grade_level, email)`
2. `grades(grade_id, student_id, assignment_id, grade, numeric_score)`
3. `assignments(assignment_id, assignment_name, due_date)`
4. `participation_behavior(record_id, student_id, attendance, participation_grade, behavior_grade)`

Use SQL functions like `CASE`, `MAX()`, `AVG()`, and `LEFT JOIN` to complete the task. Make sure the result includes all students, even if they are missing some grades or participation records.

---

### Key Functions Used in the Query

1. **`CREATE VIEW`**: This function creates a virtual table based on a query. The view allows the same query to be reused without writing it again. In this case, it creates a view called `ReportCard`.

2. **`SELECT`**: The `SELECT` statement retrieves columns of data, including `student_id`, `first_name`, and `last_name` from the `students` table.

3. **`CASE`**: The `CASE` statement acts like an `IF` statement, allowing conditional logic in SQL. It checks if the `assignment_id` matches a specific value (1, 2, or 3), then returns the `numeric_score` for that assignment.

4. **`MAX()`**: The `MAX()` function is used here to pivot data. It selects the highest value (in this case, the single grade) from the `CASE` statements for each `assignment_id`, effectively turning assignments into columns.

5. **`AVG()`**: This function calculates the average of values, used here to compute the average participation and behavior grades for each student.

6. **`LEFT JOIN`**: The `LEFT JOIN` function ensures all students from the `students` table are included in the results, even if they don’t have matching records in the `grades`, `assignments`, or `participation_behavior` tables.

7. **`GROUP BY`**: This groups the result set by `student_id`, `first_name`, and `last_name`, so the aggregate functions (`MAX()`, `AVG()`) apply to each student.

---

In [36]:
report_card_view = """
CREATE VIEW ReportCard AS
SELECT 
    s.student_id, 
    s.first_name, 
    s.last_name,
    MAX(CASE WHEN a.assignment_id = 1 THEN g.numeric_score END) as 'Assignment 1',
    MAX(CASE WHEN a.assignment_id = 2 THEN g.numeric_score END) as 'Assignment 2',
    MAX(CASE WHEN a.assignment_id = 3 THEN g.numeric_score END) as 'Assignment 3',
    AVG(p.participation_grade) as avg_participation_grade,
    AVG(p.behavior_grade) as avg_behavior_grade
FROM students s
LEFT JOIN 
    grades g ON s.student_id = g.student_id
LEFT JOIN 
    assignments a ON g.assignment_id = a.assignment_id
LEFT JOIN 
    participation_behavior p ON s.student_id = p.student_id
GROUP BY 
    s.student_id, s.first_name, s.last_name
    
"""

conn.execute(report_card_view)
conn.commit()

sql("SELECT * FROM ReportCard")

,student_id,first_name,last_name,Assignment 1,Assignment 2,Assignment 3,avg_participation_grade,avg_behavior_grade
0,1,Ryan,Sanchez,12,90,84,8.0,6.0
1,2,Emily,Ramirez,88,82,66,7.0,5.0
2,3,John,Smith,73,66,62,5.0,2.0
3,4,Ava,Harris,61,91,82,1.0,9.0
4,5,David,Robinson,48,75,94,6.0,4.0
5,6,Sarah,Garcia,85,88,58,1.0,1.0
6,7,Brandon,Thompson,61,49,82,4.0,1.0
7,8,Chris,Wilson,68,61,83,4.0,3.0
8,9,Zach,Hernandez,71,15,77,2.0,10.0
9,10,Emma,Rodriguez,66,60,90,8.0,5.0
10,11,Alex,Jones,97,6,100,3.0,10.0
11,12,Joshua,Miller,96,77,76,3.0,5.0
12,13,Olivia,Perez,99,68,10,10.0,1.0
13,14,Jane,Brown,2,5,69,10.0,7.0
14,15,Chloe,Williams,97,36,91,4.0,2.0
15,16,Matthew,Jackson,79,0,19,2.0,5.0
16,17,Mia,Johnson,31,70,100,10.0,1.0
17,18,Lily,Clark,92,2,79,9.0,7.0
18,19,Grace,Gonzalez,69,83,82,2.0,9.0
19,20,Laura,Martinez,65,73,80,1.0,7.0
20,21,Sophia,Martin,89,70,99,2.0,7.0
21,22,Anna,Lewis,59,43,85,8.0,3.0
22,23,Robert,Davis,83,66,89,3.0,9.0
23,24,Katie,Moore,67,88,62,10.0,9.0
24,25,Michael,Lee,87,54,97,8.0,7.0
25,26,Andrew,Taylor,60,15,97,6.0,4.0
26,27,Tyler,Lopez,64,84,31,5.0,8.0
27,28,James,Thomas,62,81,66,8.0,10.0
28,29,Daniel,White,95,76,68,6.0,1.0
29,30,Isabella,Anderson,87,89,1,6.0,3.0

In [37]:
test_instance.report_card_view_test(conn, report_card_view)

ReportCard view was created successfully with correct columns and valid scores

### What are Views?

A `view` is a virtual table in a database, created by writing a query that selects data from one or more underlying tables. Unlike regular tables, views do not store data themselves but instead dynamically display results from the underlying data when queried. You can think of a view as a saved SQL query that can be reused just like a table.

When you create a `view`, it’s like taking a snapshot of a specific query, which can then be referenced by name, making it easier to work with complex queries or repeated data needs.

Why Use Views?

- Simplification of Complex Queries: Views help simplify complex queries by allowing you to store the query logic. Instead of writing a long query repeatedly, you can reference the view, which saves time and reduces errors.

  - For example, our report card query is long and uses a a lot of logic. We would use it often so it would be a great use case.

- Security: Views can provide an additional layer of security. By restricting access to certain columns or rows in a table, views allow you to expose only the data a user needs to see.

  - For example, you might create a view that hides sensitive data, such as emails or personal information, while still allowing access to essential details like grades or attendance.

- Consistency: Views ensure that any repetitive business logic or complex calculations are performed consistently every time. This eliminates the risk of inconsistencies if different users write queries differently to access the same information.

- Performance: In some cases, views can improve performance by predefining complex joins or calculations. This can make querying faster, especially for commonly used queries.

# Indexes

### What is an Index in SQL?
An `index` in SQL is like a "shortcut" that helps the database find data faster. Instead of scanning the entire table, the database can use the index to quickly locate the rows it needs.

### Why Use Indexes?
- Faster Searches: If you frequently search for specific data (like finding a student by student_id), an index can speed up the process.
- Improved Sorting: When you sort or filter data (e.g., by last_name), an index helps the database do it more efficiently.
- Better Performance for Joins: When joining tables (e.g., matching students to their grades), an index can make this process faster.

How to Create an Index
You can create an index on a column (or multiple columns) in a table to improve performance.

**Syntax:**
``` sql
CREATE INDEX index_name ON table_name (column_name);
```
Example: Creating an Index on student_id
``` sql
CREATE INDEX idx_student_id ON students (student_id);
```
**Explanation:**
This creates an `index` on the student_id column of the students table. Now, any query that searches for a student by student_id will be faster.
Considerations for Indexes
Indexes Speed Up Queries: They are helpful when searching, filtering, or sorting data.
Indexes Use Extra Storage: They take up space in the database.
Indexes Slow Down Updates: When adding, updating, or deleting data, the index also needs to be updated, which can slow things down slightly.
When to Use Indexes
Create indexes on columns that are frequently used in WHERE clauses (e.g., student_id).
Avoid creating too many indexes because they require extra space and can slow down data changes.
Example Query Using an Index:
Suppose you have a grades table and frequently search by student_id. Creating an index on student_id makes these searches faster:

Copy code
``` sql
CREATE INDEX idx_grades_student_id ON grades (student_id);
```
Indexes help make your database more efficient, especially for large datasets. Just remember to use them wisely to avoid performance issues!